START TRANSACTION;

INSERT INTO
  products (
    id,
    "name",
    created_at,
    updated_at,
    published_at
  )
VALUES
  (1, 'ชานมไต้หวัน', NOW(), NOW(), NOW()),
  (2, 'ชานมชมพู', NOW(), NOW(), NOW()),
  (3, 'ชาเย็น (ชาไทย)', NOW(), NOW(), NOW()),
  (4, 'ชานมเผือก', NOW(), NOW(), NOW()),
  (5, 'ชานมโอวัลติน', NOW(), NOW(), NOW()),
  (6, 'ชานมเมล่อน', NOW(), NOW(), NOW()),
  (7, 'ชานมแอปเปิ้ล', NOW(), NOW(), NOW()),
  (8, 'ชานมสตอเบอรี่', NOW(), NOW(), NOW()),
  (9, 'ชานมโกโก้', NOW(), NOW(), NOW()),
  (10, 'ชานมไวท์มอลต์', NOW(), NOW(), NOW()),
  (11, 'ชานมกาแฟ', NOW(), NOW(), NOW()),
  (12, 'ชานมน้ำผึ้ง', NOW(), NOW(), NOW()),
  (13, 'ชาน้ำผึ้งมะนาว', NOW(), NOW(), NOW()),
  (
    14,
    'Taiwan Milktea Brown Sugar Sauce',
    NOW(),
    NOW(),
    NOW()
  ),
  (15, 'ชานมไข่มุก', NOW(), NOW(), NOW()),
  (16, 'ชาเขียวนม', NOW(), NOW(), NOW()),
  (17, 'ชาเขียวมะลิ', NOW(), NOW(), NOW()),
  (18, 'ชาเขียวสตอเบอรี่', NOW(), NOW(), NOW()),
  (
    19,
    'ชาเขียวโยเกิร์ตสตอเบอรี่',
    NOW(),
    NOW(),
    NOW()
  ),
  (
    20,
    'ชาเขียวโยเกิร์ตแอปเปื้ล',
    NOW(),
    NOW(),
    NOW()
  ),
  (
    21,
    'ชาเขียวโยเกิร์ตลิ้นจี่',
    NOW(),
    NOW(),
    NOW()
  ),
  (22, 'ชาเขียวแอปเปิ้ล', NOW(), NOW(), NOW()),
  (23, 'ชาเขียวลิ้นจี่', NOW(), NOW(), NOW()),
  (24, 'ชาเขียวบ๊วย', NOW(), NOW(), NOW()),
  (25, 'ชาเขียวเมล่อน', NOW(), NOW(), NOW()),
  (26, 'ชาเขียวโยเกิร์ต', NOW(), NOW(), NOW()),
  (27, 'ชาเขียวเสาวรส', NOW(), NOW(), NOW()),
  (28, 'ชาเขียวน้ำผึ้งมะนาว', NOW(), NOW(), NOW()),
  (29, 'ชานมสด', NOW(), NOW(), NOW()),
  (30, 'โกโก้นมสด', NOW(), NOW(), NOW()),
  (31, 'โอวัลตินนมสด', NOW(), NOW(), NOW()),
  (32, 'แอปเปิ้ลนมสด', NOW(), NOW(), NOW()),
  (33, 'สตอเบอรี่นมสด', NOW(), NOW(), NOW()),
  (34, 'เมล่อนนมสด', NOW(), NOW(), NOW()),
  (35, 'ชาเขียวมัทฉะ', NOW(), NOW(), NOW()),
  (36, 'แอปเปิ้ลโซดา', NOW(), NOW(), NOW()),
  (37, 'สตอเบอรี่โซดา', NOW(), NOW(), NOW()),
  (38, 'ลิ้นจี่โซดา', NOW(), NOW(), NOW()),
  (39, 'แดงโซดา', NOW(), NOW(), NOW()),
  (40, 'แดงโซดามะนาว', NOW(), NOW(), NOW()),
  (41, 'เสาวรสโซดา', NOW(), NOW(), NOW()),
  (42, 'เมล่อนโซดา', NOW(), NOW(), NOW()),
  (43, 'กีวี่โซดา', NOW(), NOW(), NOW()),
  (44, 'บลูฮาวายโทนิค', NOW(), NOW(), NOW()),
  (45, 'หมีล้วน', NOW(), NOW(), NOW()),
  (46, 'หมีล้วนภูเขาไฟ', NOW(), NOW(), NOW()),
  (47, 'นมหมีชมพู', NOW(), NOW(), NOW()),
  (48, 'นมหมีเผือกหอม', NOW(), NOW(), NOW()),
  (49, 'นมหมีสตอเบอรี่', NOW(), NOW(), NOW()),
  (50, 'นมหมีบราวน์ชูการ์', NOW(), NOW(), NOW()),
  (51, 'นมหมีน้ำผึ้ง', NOW(), NOW(), NOW()),
  (52, 'หมีล้วนปั่น', NOW(), NOW(), NOW()),
  (53, 'หมีภูเขาไฟปั่น', NOW(), NOW(), NOW()),
  (54, 'หมีชมพูปั่น', NOW(), NOW(), NOW()),
  (55, 'หมีเผือกหอมปั่น', NOW(), NOW(), NOW()),
  (56, 'หมีบราวน์ชูการ์ปั่น', NOW(), NOW(), NOW()),
  (57, 'หมีสตอเบอรี่ปั่น', NOW(), NOW(), NOW()),
  (58, 'หมีฮันนี่ปั่น', NOW(), NOW(), NOW()),
  (59, 'หมีโกโก้ปั่น', NOW(), NOW(), NOW()),
  (60, 'หมีโอริโอ้ปั่น', NOW(), NOW(), NOW());

ALTER SEQUENCE products_id_seq RESTART 61;

END TRANSACTION;
