START TRANSACTION;

INSERT INTO
  products (
    id,
    "name",
    cost,
    created_at,
    updated_at,
    published_at
  )
VALUES
  (1, 'ชานมไต้หวัน', 6.96, NOW(), NOW(), NOW()),
  (2, 'ชานมชมพู', 9.56, NOW(), NOW(), NOW()),
  (3, 'ชาเย็น (ชาไทย)', 7.64, NOW(), NOW(), NOW()),
  (4, 'ชานมเผือก', 13.96, NOW(), NOW(), NOW()),
  (5, 'ชานมโอวัลติน', 12.81, NOW(), NOW(), NOW()),
  (6, 'ชานมเมล่อน', 13.53, NOW(), NOW(), NOW()),
  (7, 'ชานมแอปเปิ้ล', 13.53, NOW(), NOW(), NOW()),
  (8, 'ชานมสตอเบอรี่', 13.53, NOW(), NOW(), NOW()),
  (9, 'ชานมโกโก้', 11.87, NOW(), NOW(), NOW()),
  (10, 'ชานมไวท์มอลต์', 15.71, NOW(), NOW(), NOW()),
  (11, 'ชานมกาแฟ', 16.73, NOW(), NOW(), NOW()),
  (12, 'ชานมน้ำผึ้ง', 13.26, NOW(), NOW(), NOW()),
  (13, 'ชาน้ำผึ้งมะนาว', 0, NOW(), NOW(), NOW()),
  (
    14,
    'ชานมบราวน์ชูการ์',
    9.26,
    NOW(),
    NOW(),
    NOW()
  ),
  (15, 'ชานมไข่มุก', 0, NOW(), NOW(), NOW()),
  (16, 'ชาเขียวนม', 9.96, NOW(), NOW(), NOW()),
  (17, 'ชาเขียวมะลิ', 7.18, NOW(), NOW(), NOW()),
  (
    18,
    'ชาเขียวสตอเบอรี่',
    9.48,
    NOW(),
    NOW(),
    NOW()
  ),
  (
    19,
    'ชาเขียวสตอเบอรี่โยเกิร์ต',
    16.13,
    NOW(),
    NOW(),
    NOW()
  ),
  (
    20,
    'ชาเขียวแอปเปื้ลโยเกิร์ต',
    16.13,
    NOW(),
    NOW(),
    NOW()
  ),
  (
    21,
    'ชาเขียวลิ้นจี่โยเกิร์ต',
    16.13,
    NOW(),
    NOW(),
    NOW()
  ),
  (22, 'ชาเขียวแอปเปิ้ล', 9.48, NOW(), NOW(), NOW()),
  (23, 'ชาเขียวลิ้นจี่', 9.48, NOW(), NOW(), NOW()),
  (24, 'ชาเขียวบ๊วย', 8.18, NOW(), NOW(), NOW()),
  (25, 'ชาเขียวเมล่อน', 9.48, NOW(), NOW(), NOW()),
  (
    26,
    'ชาเขียวโยเกิร์ต',
    14.53,
    NOW(),
    NOW(),
    NOW()
  ),
  (27, 'ชาเขียวเสาวรส', 9.48, NOW(), NOW(), NOW()),
  (
    28,
    'ชาเขียวน้ำผึ้งมะนาว',
    9.08,
    NOW(),
    NOW(),
    NOW()
  ),
  (29, 'ชานมสด', 0, NOW(), NOW(), NOW()),
  (30, 'โกโก้นมสด', 0, NOW(), NOW(), NOW()),
  (31, 'โอวัลตินนมสด', 0, NOW(), NOW(), NOW()),
  (32, 'แอปเปิ้ลนมสด', 0, NOW(), NOW(), NOW()),
  (33, 'สตอเบอรี่นมสด', 0, NOW(), NOW(), NOW()),
  (34, 'เมล่อนนมสด', 0, NOW(), NOW(), NOW()),
  (35, 'ชาเขียวมัทฉะ', 0, NOW(), NOW(), NOW()),
  (36, 'แอปเปิ้ลโซดา', 0, NOW(), NOW(), NOW()),
  (37, 'สตอเบอรี่โซดา', 0, NOW(), NOW(), NOW()),
  (38, 'ลิ้นจี่โซดา', 0, NOW(), NOW(), NOW()),
  (39, 'แดงโซดา', 0, NOW(), NOW(), NOW()),
  (40, 'แดงโซดามะนาว', 0, NOW(), NOW(), NOW()),
  (41, 'เสาวรสโซดา', 0, NOW(), NOW(), NOW()),
  (42, 'เมล่อนโซดา', 0, NOW(), NOW(), NOW()),
  (43, 'กีวี่โซดา', 0, NOW(), NOW(), NOW()),
  (44, 'บลูฮาวายโซดา', 0, NOW(), NOW(), NOW()),
  (45, 'สับปะรดโซดา', 0, NOW(), NOW(), NOW()),
  (46, 'เขียวโซดามะนาว', 0, NOW(), NOW(), NOW()),
  (47, 'หมีล้วน', 0, NOW(), NOW(), NOW()),
  (48, 'หมีล้วนภูเขาไฟ', 0, NOW(), NOW(), NOW()),
  (49, 'หมีชมพู', 0, NOW(), NOW(), NOW()),
  (50, 'หมีเผือก', 0, NOW(), NOW(), NOW()),
  (51, 'หมีสตอเบอรี่', 0, NOW(), NOW(), NOW()),
  (52, 'หมีบราวน์ชูการ์', 0, NOW(), NOW(), NOW()),
  (53, 'หมีน้ำผึ้ง', 0, NOW(), NOW(), NOW()),
  (54, 'หมีล้วนปั่น', 0, NOW(), NOW(), NOW()),
  (55, 'หมีภูเขาไฟปั่น', 0, NOW(), NOW(), NOW()),
  (56, 'หมีชมพูปั่น', 0, NOW(), NOW(), NOW()),
  (57, 'หมีเผือกปั่น', 0, NOW(), NOW(), NOW()),
  (
    58,
    'หมีบราวน์ชูการ์ปั่น',
    0,
    NOW(),
    NOW(),
    NOW()
  ),
  (59, 'หมีสตอเบอรี่ปั่น', 0, NOW(), NOW(), NOW()),
  (60, 'หมีน้ำผึ้งปั่น', 0, NOW(), NOW(), NOW()),
  (61, 'หมีโกโก้ปั่น', 0, NOW(), NOW(), NOW()),
  (62, 'หมีโอริโอ้ปั่น', 0, NOW(), NOW(), NOW()),
  (63, 'อื่นๆ', 0, NOW(), NOW(), NOW()),
  (64, 'กาแฟร้อน', 0, NOW(), NOW(), NOW()),
  (65, 'หมีคาราเมล', 0, NOW(), NOW(), NOW()),
  (66, 'หมีคาราเมลปั่น', 0, NOW(), NOW(), NOW()),
  (67, 'หมีโกโก้', 0, NOW(), NOW(), NOW()) ON CONFLICT (id) DO
UPDATE
SET
  "name" = EXCLUDED."name",
  "cost" = EXCLUDED."cost";

ALTER SEQUENCE products_id_seq RESTART 68;

END TRANSACTION;
